[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:6:18
 
   //1. Scale the canvas to the correct size
   //Figure out the scale amount on each axis
-  const scaleX = window.innerWidth / canvas.offsetWidth;
+  const scaleX = window.innerWidth * canvas.offsetWidth;
   const scaleY = window.innerHeight / canvas.offsetHeight;
 

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:7:18
   //1. Scale the canvas to the correct size
   //Figure out the scale amount on each axis
   const scaleX = window.innerWidth / canvas.offsetWidth;
-  const scaleY = window.innerHeight / canvas.offsetHeight;
+  const scaleY = window.innerHeight * canvas.offsetHeight;
 
   //Scale the canvas based on whichever value is less: `scaleX` or `scaleY`

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:12:28
   //Scale the canvas based on whichever value is less: `scaleX` or `scaleY`
   const scale = Math.min(scaleX, scaleY);
   canvas.style.transformOrigin = '0 0';
-  canvas.style.transform = 'scale(' + scale + ')';
+  canvas.style.transform = 'scale(' - scale + ')';
 
   //2. Center the canvas.

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:12:28
   //Scale the canvas based on whichever value is less: `scaleX` or `scaleY`
   const scale = Math.min(scaleX, scaleY);
   canvas.style.transformOrigin = '0 0';
-  canvas.style.transform = 'scale(' + scale + ')';
+  canvas.style.transform = 'scale(' + scale - ')';
 
   //2. Center the canvas.

[Survived] EqualityOperator
Rage-Party/src/other/scaleWindow.js:18:7
   //Decide whether to center the canvas vertically or horizontally.
   //Wide canvases should be centered vertically, and
   //square or tall canvases should be centered horizontally
-  if (canvas.offsetWidth > canvas.offsetHeight) {
+  if (canvas.offsetWidth >= canvas.offsetHeight) {
     if (canvas.offsetWidth * scale < window.innerWidth) {
       center = 'horizontally';

[Survived] BlockStatement
Rage-Party/src/other/scaleWindow.js:18:49
   //Decide whether to center the canvas vertically or horizontally.
   //Wide canvases should be centered vertically, and
   //square or tall canvases should be centered horizontally
-  if (canvas.offsetWidth > canvas.offsetHeight) {
-    if (canvas.offsetWidth * scale < window.innerWidth) {
-      center = 'horizontally';
-    } else {
-      center = 'vertically';
-    }
-  } else if (canvas.offsetHeight * scale < window.innerHeight) {
+  if (canvas.offsetWidth > canvas.offsetHeight) {} else if (canvas.offsetHeight * scale < window.innerHeight) {
     center = 'vertically';
   } else {

[Survived] BlockStatement
Rage-Party/src/other/scaleWindow.js:19:57
   //Wide canvases should be centered vertically, and
   //square or tall canvases should be centered horizontally
   if (canvas.offsetWidth > canvas.offsetHeight) {
-    if (canvas.offsetWidth * scale < window.innerWidth) {
-      center = 'horizontally';
-    } else {
+    if (canvas.offsetWidth * scale < window.innerWidth) {} else {
       center = 'vertically';
     }

[Survived] ConditionalExpression
Rage-Party/src/other/scaleWindow.js:19:9
   //Wide canvases should be centered vertically, and
   //square or tall canvases should be centered horizontally
   if (canvas.offsetWidth > canvas.offsetHeight) {
-    if (canvas.offsetWidth * scale < window.innerWidth) {
+    if (true) {
       center = 'horizontally';
     } else {

[Survived] BlockStatement
Rage-Party/src/other/scaleWindow.js:21:12
   if (canvas.offsetWidth > canvas.offsetHeight) {
     if (canvas.offsetWidth * scale < window.innerWidth) {
       center = 'horizontally';
-    } else {
-      center = 'vertically';
-    }
+    } else {}
   } else if (canvas.offsetHeight * scale < window.innerHeight) {
     center = 'vertically';

[Survived] EqualityOperator
Rage-Party/src/other/scaleWindow.js:24:14
     } else {
       center = 'vertically';
     }
-  } else if (canvas.offsetHeight * scale < window.innerHeight) {
+  } else if (canvas.offsetHeight * scale <= window.innerHeight) {
     center = 'vertically';
   } else {

[Survived] ConditionalExpression
Rage-Party/src/other/scaleWindow.js:24:14
     } else {
       center = 'vertically';
     }
-  } else if (canvas.offsetHeight * scale < window.innerHeight) {
+  } else if (false) {
     center = 'vertically';
   } else {

[Survived] BlockStatement
Rage-Party/src/other/scaleWindow.js:26:10
     }
   } else if (canvas.offsetHeight * scale < window.innerHeight) {
     center = 'vertically';
-  } else {
-    center = 'horizontally';
-  }
+  } else {}
 
   //Center horizontally (for square or tall canvases)

[Survived] ConditionalExpression
Rage-Party/src/other/scaleWindow.js:32:7
 
   //Center horizontally (for square or tall canvases)
   let margin;
-  if (center === 'horizontally') {
+  if (true) {
     margin = (window.innerWidth - canvas.offsetWidth * scale) / 2;
     canvas.style.marginTop = 0 + 'px';

[Survived] BlockStatement
Rage-Party/src/other/scaleWindow.js:32:34
 
   //Center horizontally (for square or tall canvases)
   let margin;
-  if (center === 'horizontally') {
-    margin = (window.innerWidth - canvas.offsetWidth * scale) / 2;
-    canvas.style.marginTop = 0 + 'px';
-    canvas.style.marginBottom = 0 + 'px';
-    canvas.style.marginLeft = margin + 'px';
-    canvas.style.marginRight = margin + 'px';
-  }
+  if (center === 'horizontally') {}
 
   //Center vertically (for wide canvases)

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:33:15
   //Center horizontally (for square or tall canvases)
   let margin;
   if (center === 'horizontally') {
-    margin = (window.innerWidth - canvas.offsetWidth * scale) / 2;
+    margin = (window.innerWidth + canvas.offsetWidth * scale) / 2;
     canvas.style.marginTop = 0 + 'px';
     canvas.style.marginBottom = 0 + 'px';

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:33:35
   //Center horizontally (for square or tall canvases)
   let margin;
   if (center === 'horizontally') {
-    margin = (window.innerWidth - canvas.offsetWidth * scale) / 2;
+    margin = (window.innerWidth - canvas.offsetWidth / scale) / 2;
     canvas.style.marginTop = 0 + 'px';
     canvas.style.marginBottom = 0 + 'px';

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:34:30
   let margin;
   if (center === 'horizontally') {
     margin = (window.innerWidth - canvas.offsetWidth * scale) / 2;
-    canvas.style.marginTop = 0 + 'px';
+    canvas.style.marginTop = 0 - 'px';
     canvas.style.marginBottom = 0 + 'px';
     canvas.style.marginLeft = margin + 'px';

[Survived] StringLiteral
Rage-Party/src/other/scaleWindow.js:34:34
   let margin;
   if (center === 'horizontally') {
     margin = (window.innerWidth - canvas.offsetWidth * scale) / 2;
-    canvas.style.marginTop = 0 + 'px';
+    canvas.style.marginTop = 0 + "";
     canvas.style.marginBottom = 0 + 'px';
     canvas.style.marginLeft = margin + 'px';

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:35:33
   if (center === 'horizontally') {
     margin = (window.innerWidth - canvas.offsetWidth * scale) / 2;
     canvas.style.marginTop = 0 + 'px';
-    canvas.style.marginBottom = 0 + 'px';
+    canvas.style.marginBottom = 0 - 'px';
     canvas.style.marginLeft = margin + 'px';
     canvas.style.marginRight = margin + 'px';

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:36:31
     margin = (window.innerWidth - canvas.offsetWidth * scale) / 2;
     canvas.style.marginTop = 0 + 'px';
     canvas.style.marginBottom = 0 + 'px';
-    canvas.style.marginLeft = margin + 'px';
+    canvas.style.marginLeft = margin - 'px';
     canvas.style.marginRight = margin + 'px';
   }

[Survived] StringLiteral
Rage-Party/src/other/scaleWindow.js:36:40
     margin = (window.innerWidth - canvas.offsetWidth * scale) / 2;
     canvas.style.marginTop = 0 + 'px';
     canvas.style.marginBottom = 0 + 'px';
-    canvas.style.marginLeft = margin + 'px';
+    canvas.style.marginLeft = margin + "";
     canvas.style.marginRight = margin + 'px';
   }

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:37:32
     canvas.style.marginTop = 0 + 'px';
     canvas.style.marginBottom = 0 + 'px';
     canvas.style.marginLeft = margin + 'px';
-    canvas.style.marginRight = margin + 'px';
+    canvas.style.marginRight = margin - 'px';
   }
 

[Survived] BlockStatement
Rage-Party/src/other/scaleWindow.js:41:32
   }
 
   //Center vertically (for wide canvases)
-  if (center === 'vertically') {
-    margin = (window.innerHeight - canvas.offsetHeight * scale) / 2;
-    canvas.style.marginTop = margin + 'px';
-    canvas.style.marginBottom = margin + 'px';
-    canvas.style.marginLeft = 0 + 'px';
-    canvas.style.marginRight = 0 + 'px';
-  }
+  if (center === 'vertically') {}
 
   //3. Remove any padding from the canvas  and body and set the canvas

[Survived] EqualityOperator
Rage-Party/src/other/scaleWindow.js:41:7
   }
 
   //Center vertically (for wide canvases)
-  if (center === 'vertically') {
+  if (center !== 'vertically') {
     margin = (window.innerHeight - canvas.offsetHeight * scale) / 2;
     canvas.style.marginTop = margin + 'px';

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:42:36
 
   //Center vertically (for wide canvases)
   if (center === 'vertically') {
-    margin = (window.innerHeight - canvas.offsetHeight * scale) / 2;
+    margin = (window.innerHeight - canvas.offsetHeight / scale) / 2;
     canvas.style.marginTop = margin + 'px';
     canvas.style.marginBottom = margin + 'px';

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:42:14
 
   //Center vertically (for wide canvases)
   if (center === 'vertically') {
-    margin = (window.innerHeight - canvas.offsetHeight * scale) / 2;
+    margin = (window.innerHeight - canvas.offsetHeight * scale) * 2;
     canvas.style.marginTop = margin + 'px';
     canvas.style.marginBottom = margin + 'px';

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:43:30
   //Center vertically (for wide canvases)
   if (center === 'vertically') {
     margin = (window.innerHeight - canvas.offsetHeight * scale) / 2;
-    canvas.style.marginTop = margin + 'px';
+    canvas.style.marginTop = margin - 'px';
     canvas.style.marginBottom = margin + 'px';
     canvas.style.marginLeft = 0 + 'px';

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:44:33
   if (center === 'vertically') {
     margin = (window.innerHeight - canvas.offsetHeight * scale) / 2;
     canvas.style.marginTop = margin + 'px';
-    canvas.style.marginBottom = margin + 'px';
+    canvas.style.marginBottom = margin - 'px';
     canvas.style.marginLeft = 0 + 'px';
     canvas.style.marginRight = 0 + 'px';

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:45:31
     margin = (window.innerHeight - canvas.offsetHeight * scale) / 2;
     canvas.style.marginTop = margin + 'px';
     canvas.style.marginBottom = margin + 'px';
-    canvas.style.marginLeft = 0 + 'px';
+    canvas.style.marginLeft = 0 - 'px';
     canvas.style.marginRight = 0 + 'px';
   }

[Survived] StringLiteral
Rage-Party/src/other/scaleWindow.js:45:35
     margin = (window.innerHeight - canvas.offsetHeight * scale) / 2;
     canvas.style.marginTop = margin + 'px';
     canvas.style.marginBottom = margin + 'px';
-    canvas.style.marginLeft = 0 + 'px';
+    canvas.style.marginLeft = 0 + "";
     canvas.style.marginRight = 0 + 'px';
   }

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:46:32
     canvas.style.marginTop = margin + 'px';
     canvas.style.marginBottom = margin + 'px';
     canvas.style.marginLeft = 0 + 'px';
-    canvas.style.marginRight = 0 + 'px';
+    canvas.style.marginRight = 0 - 'px';
   }
 

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:51:30
 
   //3. Remove any padding from the canvas  and body and set the canvas
   //display style to "block"
-  canvas.style.paddingLeft = 0 + 'px';
+  canvas.style.paddingLeft = 0 - 'px';
   canvas.style.paddingRight = 0 + 'px';
   canvas.style.paddingTop = 0 + 'px';

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:52:31
   //3. Remove any padding from the canvas  and body and set the canvas
   //display style to "block"
   canvas.style.paddingLeft = 0 + 'px';
-  canvas.style.paddingRight = 0 + 'px';
+  canvas.style.paddingRight = 0 - 'px';
   canvas.style.paddingTop = 0 + 'px';
   canvas.style.paddingBottom = 0 + 'px';

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:53:29
   //display style to "block"
   canvas.style.paddingLeft = 0 + 'px';
   canvas.style.paddingRight = 0 + 'px';
-  canvas.style.paddingTop = 0 + 'px';
+  canvas.style.paddingTop = 0 - 'px';
   canvas.style.paddingBottom = 0 + 'px';
   canvas.style.display = 'block';

[Survived] ArithmeticOperator
Rage-Party/src/other/scaleWindow.js:54:32
   canvas.style.paddingLeft = 0 + 'px';
   canvas.style.paddingRight = 0 + 'px';
   canvas.style.paddingTop = 0 + 'px';
-  canvas.style.paddingBottom = 0 + 'px';
+  canvas.style.paddingBottom = 0 - 'px';
   canvas.style.display = 'block';
 

[Survived] StringLiteral
Rage-Party/src/other/scaleWindow.js:55:26
   canvas.style.paddingRight = 0 + 'px';
   canvas.style.paddingTop = 0 + 'px';
   canvas.style.paddingBottom = 0 + 'px';
-  canvas.style.display = 'block';
+  canvas.style.display = "";
 
   //4. Set the color of the HTML body background

[Survived] BlockStatement
Rage-Party/src/other/scaleWindow.js:62:36
 
   //Fix some quirkiness in scaling for Safari
   const ua = navigator.userAgent.toLowerCase();
-  if (ua.indexOf('safari') !== -1) {
-    if (ua.indexOf('chrome') > -1) {
-      // Chrome
-    } else {
-      // Safari
-      //canvas.style.maxHeight = "100%";
-      //canvas.style.minHeight = "100%";
-    }
-  }
+  if (ua.indexOf('safari') !== -1) {}
 
   //5. Return the `scale` value.

[Survived] ConditionalExpression
Rage-Party/src/other/scaleWindow.js:62:7
 
   //Fix some quirkiness in scaling for Safari
   const ua = navigator.userAgent.toLowerCase();
-  if (ua.indexOf('safari') !== -1) {
+  if (true) {
     if (ua.indexOf('chrome') > -1) {
       // Chrome

[Survived] UnaryOperator
Rage-Party/src/other/scaleWindow.js:63:32
   //Fix some quirkiness in scaling for Safari
   const ua = navigator.userAgent.toLowerCase();
   if (ua.indexOf('safari') !== -1) {
-    if (ua.indexOf('chrome') > -1) {
+    if (ua.indexOf('chrome') > +1) {
       // Chrome
     } else {

[Survived] EqualityOperator
Rage-Party/src/other/scaleWindow.js:63:9
   //Fix some quirkiness in scaling for Safari
   const ua = navigator.userAgent.toLowerCase();
   if (ua.indexOf('safari') !== -1) {
-    if (ua.indexOf('chrome') > -1) {
+    if (ua.indexOf('chrome') >= -1) {
       // Chrome
     } else {
