[Survived] ConditionalExpression
Rage-Party/src/scripts/contain.js:17:7
   };
 
   //Left
-  if (container.position.x >= sprite.position.x - 95) {
+  if (true) {
     collision.x = collisionType.left;
   }

[Survived] ArithmeticOperator
Rage-Party/src/scripts/contain.js:17:31
   };
 
   //Left
-  if (container.position.x >= sprite.position.x - 95) {
+  if (container.position.x >= sprite.position.x + 95) {
     collision.x = collisionType.left;
   }

[Survived] ConditionalExpression
Rage-Party/src/scripts/contain.js:22:7
   }
 
   // Right
-  if (sprite.position.x + sprite.width + 95 >=
-    container.position.x + container.width) {
+  if (false) {
     collision.x = collisionType.right;
   }

[Survived] EqualityOperator
Rage-Party/src/scripts/contain.js:22:7
   }
 
   // Right
-  if (sprite.position.x + sprite.width + 95 >=
-    container.position.x + container.width) {
+  if (sprite.position.x + sprite.width + 95 > container.position.x + container.width) {
     collision.x = collisionType.right;
   }

[Survived] BlockStatement
Rage-Party/src/scripts/contain.js:23:45
 
   // Right
   if (sprite.position.x + sprite.width + 95 >=
-    container.position.x + container.width) {
-    collision.x = collisionType.right;
-  }
+    container.position.x + container.width) {}
 
   //Top

[Survived] ArithmeticOperator
Rage-Party/src/scripts/contain.js:23:5
 
   // Right
   if (sprite.position.x + sprite.width + 95 >=
-    container.position.x + container.width) {
+    container.position.x - container.width) {
     collision.x = collisionType.right;
   }

[Survived] ArithmeticOperator
Rage-Party/src/scripts/contain.js:28:7
   }
 
   //Top
-  if (sprite.position.y - 90 + (sprite.height * 0.5) <= container.position.y) {
+  if (sprite.position.y - 90 - sprite.height * 0.5 <= container.position.y) {
     collision.y = collisionType.top;
   }

[Survived] ConditionalExpression
Rage-Party/src/scripts/contain.js:28:7
   }
 
   //Top
-  if (sprite.position.y - 90 + (sprite.height * 0.5) <= container.position.y) {
+  if (true) {
     collision.y = collisionType.top;
   }

[Survived] ConditionalExpression
Rage-Party/src/scripts/contain.js:33:7
   }
 
   // Down
-  if (sprite.position.y + sprite.height + 90 >=
-    container.position.y + container.height) {
+  if (true) {
     collision.y = collisionType.down;
   }

[Survived] EqualityOperator
Rage-Party/src/scripts/contain.js:33:7
   }
 
   // Down
-  if (sprite.position.y + sprite.height + 90 >=
-    container.position.y + container.height) {
+  if (sprite.position.y + sprite.height + 90 > container.position.y + container.height) {
     collision.y = collisionType.down;
   }

[Survived] ArithmeticOperator
Rage-Party/src/scripts/contain.js:34:5
 
   // Down
   if (sprite.position.y + sprite.height + 90 >=
-    container.position.y + container.height) {
+    container.position.y - container.height) {
     collision.y = collisionType.down;
   }

[Survived] BlockStatement
Rage-Party/src/scripts/contain.js:34:46
 
   // Down
   if (sprite.position.y + sprite.height + 90 >=
-    container.position.y + container.height) {
-    collision.y = collisionType.down;
-  }
+    container.position.y + container.height) {}
 
   return collision;
