[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:11:18
     width: window.innerWidth,
     height: window.innerHeight,
     backgroundColor: 0x1a1f1b,
-    autoDensity: true
+    autoDensity: false
   });
 document.body.appendChild(renderer.view);

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:15:40
   });
 document.body.appendChild(renderer.view);
 
-window.addEventListener('resize', _ => {
-  ScaleToWindow(renderer.view);
-});
+window.addEventListener('resize', _ => {});
 
 // create the root of the scene graph

[Survived] StringLiteral
Rage-Party/src/scripts/game.js:25:21
 
 const bulletTexture = PIXI.Texture.from('assets/bullet.png');
 const mapTexture = PIXI.Texture.from('assets/levels/baseMap.png');
-const defaultIcon = 'url(\'./assets/utils/crosshair.cur\'),auto';
+const defaultIcon = "";
 const explosionTextures = [];
 for (let i = 1; i <= 6; i++) {

[Survived] ArrayDeclaration
Rage-Party/src/scripts/game.js:26:27
 const bulletTexture = PIXI.Texture.from('assets/bullet.png');
 const mapTexture = PIXI.Texture.from('assets/levels/baseMap.png');
 const defaultIcon = 'url(\'./assets/utils/crosshair.cur\'),auto';
-const explosionTextures = [];
+const explosionTextures = ["Stryker was here"];
 for (let i = 1; i <= 6; i++) {
   const texture = PIXI.Texture.from(

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:27:17
 const mapTexture = PIXI.Texture.from('assets/levels/baseMap.png');
 const defaultIcon = 'url(\'./assets/utils/crosshair.cur\'),auto';
 const explosionTextures = [];
-for (let i = 1; i <= 6; i++) {
+for (let i = 1; false; i++) {
   const texture = PIXI.Texture.from(
     './assets/explo_orange/explo_orange_' + i + '.png');

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:27:30
 const mapTexture = PIXI.Texture.from('assets/levels/baseMap.png');
 const defaultIcon = 'url(\'./assets/utils/crosshair.cur\'),auto';
 const explosionTextures = [];
-for (let i = 1; i <= 6; i++) {
-  const texture = PIXI.Texture.from(
-    './assets/explo_orange/explo_orange_' + i + '.png');
-  explosionTextures.push(texture);
-}
+for (let i = 1; i <= 6; i++) {}
 const playerRunLeft = [];
 for (let i = 1; i <= 6; i++) {

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:29:5
 const explosionTextures = [];
 for (let i = 1; i <= 6; i++) {
   const texture = PIXI.Texture.from(
-    './assets/explo_orange/explo_orange_' + i + '.png');
+    './assets/explo_orange/explo_orange_' - i + '.png');
   explosionTextures.push(texture);
 }

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:29:5
 const explosionTextures = [];
 for (let i = 1; i <= 6; i++) {
   const texture = PIXI.Texture.from(
-    './assets/explo_orange/explo_orange_' + i + '.png');
+    './assets/explo_orange/explo_orange_' + i - '.png');
   explosionTextures.push(texture);
 }

[Survived] EqualityOperator
Rage-Party/src/scripts/game.js:33:17
   explosionTextures.push(texture);
 }
 const playerRunLeft = [];
-for (let i = 1; i <= 6; i++) {
+for (let i = 1; i > 6; i++) {
   const texture = PIXI.Texture.from(
     './assets/hero/runLeft/hero ' + i + '.png');

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:33:17
   explosionTextures.push(texture);
 }
 const playerRunLeft = [];
-for (let i = 1; i <= 6; i++) {
+for (let i = 1; false; i++) {
   const texture = PIXI.Texture.from(
     './assets/hero/runLeft/hero ' + i + '.png');

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:35:5
 const playerRunLeft = [];
 for (let i = 1; i <= 6; i++) {
   const texture = PIXI.Texture.from(
-    './assets/hero/runLeft/hero ' + i + '.png');
+    './assets/hero/runLeft/hero ' + i - '.png');
   playerRunLeft.push(texture);
 }

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:35:5
 const playerRunLeft = [];
 for (let i = 1; i <= 6; i++) {
   const texture = PIXI.Texture.from(
-    './assets/hero/runLeft/hero ' + i + '.png');
+    './assets/hero/runLeft/hero ' - i + '.png');
   playerRunLeft.push(texture);
 }

[Survived] ArrayDeclaration
Rage-Party/src/scripts/game.js:38:24
     './assets/hero/runLeft/hero ' + i + '.png');
   playerRunLeft.push(texture);
 }
-const playerRunRight = [];
+const playerRunRight = ["Stryker was here"];
 for (let i = 1; i <= 6; i++) {
   const texture = PIXI.Texture.from(

[Survived] EqualityOperator
Rage-Party/src/scripts/game.js:39:17
   playerRunLeft.push(texture);
 }
 const playerRunRight = [];
-for (let i = 1; i <= 6; i++) {
+for (let i = 1; i < 6; i++) {
   const texture = PIXI.Texture.from(
     './assets/hero/runRight/hero ' + i + '.png');

[Survived] EqualityOperator
Rage-Party/src/scripts/game.js:39:17
   playerRunLeft.push(texture);
 }
 const playerRunRight = [];
-for (let i = 1; i <= 6; i++) {
+for (let i = 1; i > 6; i++) {
   const texture = PIXI.Texture.from(
     './assets/hero/runRight/hero ' + i + '.png');

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:41:5
 const playerRunRight = [];
 for (let i = 1; i <= 6; i++) {
   const texture = PIXI.Texture.from(
-    './assets/hero/runRight/hero ' + i + '.png');
+    './assets/hero/runRight/hero ' + i - '.png');
   playerRunRight.push(texture);
 }

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:41:5
 const playerRunRight = [];
 for (let i = 1; i <= 6; i++) {
   const texture = PIXI.Texture.from(
-    './assets/hero/runRight/hero ' + i + '.png');
+    './assets/hero/runRight/hero ' - i + '.png');
   playerRunRight.push(texture);
 }

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:50:26
   './assets/hero/runRight/hero 6.png');
 const playerRunningLeft = new PIXI.extras.AnimatedSprite(playerRunLeft),
   playerRunningRight = new PIXI.extras.AnimatedSprite(playerRunRight);
-playerRunningLeft.loop = true;
+playerRunningLeft.loop = false;
 playerRunningRight.loop = true;
 

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:51:27
 const playerRunningLeft = new PIXI.extras.AnimatedSprite(playerRunLeft),
   playerRunningRight = new PIXI.extras.AnimatedSprite(playerRunRight);
 playerRunningLeft.loop = true;
-playerRunningRight.loop = true;
+playerRunningRight.loop = false;
 
 const ammoLeftStyle = new PIXI.TextStyle({

[Survived] StringLiteral
Rage-Party/src/scripts/game.js:55:15
 
 const ammoLeftStyle = new PIXI.TextStyle({
   fill: 'white',
-  fontFamily: 'Impact',
+  fontFamily: "",
   fontSize: 40,
   stroke: 'white'

[Survived] StringLiteral
Rage-Party/src/scripts/game.js:60:9
   stroke: 'white'
 });
 const reloadStyle = new PIXI.TextStyle({
-  fill: 'red',
+  fill: "",
   fontFamily: 'Impact',
   fontSize: 40,

[Survived] StringLiteral
Rage-Party/src/scripts/game.js:63:11
   fill: 'red',
   fontFamily: 'Impact',
   fontSize: 40,
-  stroke: 'white'
+  stroke: ""
 });
 const ammoLeftText = new PIXI.Text('12 / 12', ammoLeftStyle);

[Survived] StringLiteral
Rage-Party/src/scripts/game.js:65:36
   fontSize: 40,
   stroke: 'white'
 });
-const ammoLeftText = new PIXI.Text('12 / 12', ammoLeftStyle);
+const ammoLeftText = new PIXI.Text("", ammoLeftStyle);
 ammoLeftText.x = renderer.width / 10 * 9;
 ammoLeftText.y = renderer.height / 7 * 6;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:66:18
   stroke: 'white'
 });
 const ammoLeftText = new PIXI.Text('12 / 12', ammoLeftStyle);
-ammoLeftText.x = renderer.width / 10 * 9;
+ammoLeftText.x = renderer.width / 10 / 9;
 ammoLeftText.y = renderer.height / 7 * 6;
 const reloadText = new PIXI.Text('PRESS \'R\' TO RELOAD', reloadStyle);

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:66:18
   stroke: 'white'
 });
 const ammoLeftText = new PIXI.Text('12 / 12', ammoLeftStyle);
-ammoLeftText.x = renderer.width / 10 * 9;
+ammoLeftText.x = renderer.width * 10 * 9;
 ammoLeftText.y = renderer.height / 7 * 6;
 const reloadText = new PIXI.Text('PRESS \'R\' TO RELOAD', reloadStyle);

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:67:18
 });
 const ammoLeftText = new PIXI.Text('12 / 12', ammoLeftStyle);
 ammoLeftText.x = renderer.width / 10 * 9;
-ammoLeftText.y = renderer.height / 7 * 6;
+ammoLeftText.y = renderer.height / 7 / 6;
 const reloadText = new PIXI.Text('PRESS \'R\' TO RELOAD', reloadStyle);
 reloadText.x = renderer.width / 10 * 5;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:67:18
 });
 const ammoLeftText = new PIXI.Text('12 / 12', ammoLeftStyle);
 ammoLeftText.x = renderer.width / 10 * 9;
-ammoLeftText.y = renderer.height / 7 * 6;
+ammoLeftText.y = renderer.height * 7 * 6;
 const reloadText = new PIXI.Text('PRESS \'R\' TO RELOAD', reloadStyle);
 reloadText.x = renderer.width / 10 * 5;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:69:16
 ammoLeftText.x = renderer.width / 10 * 9;
 ammoLeftText.y = renderer.height / 7 * 6;
 const reloadText = new PIXI.Text('PRESS \'R\' TO RELOAD', reloadStyle);
-reloadText.x = renderer.width / 10 * 5;
+reloadText.x = renderer.width / 10 / 5;
 reloadText.y = renderer.height / 7 * 6;
 reloadText.visible = false;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:69:16
 ammoLeftText.x = renderer.width / 10 * 9;
 ammoLeftText.y = renderer.height / 7 * 6;
 const reloadText = new PIXI.Text('PRESS \'R\' TO RELOAD', reloadStyle);
-reloadText.x = renderer.width / 10 * 5;
+reloadText.x = renderer.width * 10 * 5;
 reloadText.y = renderer.height / 7 * 6;
 reloadText.visible = false;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:70:16
 ammoLeftText.y = renderer.height / 7 * 6;
 const reloadText = new PIXI.Text('PRESS \'R\' TO RELOAD', reloadStyle);
 reloadText.x = renderer.width / 10 * 5;
-reloadText.y = renderer.height / 7 * 6;
+reloadText.y = renderer.height / 7 / 6;
 reloadText.visible = false;
 

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:70:16
 ammoLeftText.y = renderer.height / 7 * 6;
 const reloadText = new PIXI.Text('PRESS \'R\' TO RELOAD', reloadStyle);
 reloadText.x = renderer.width / 10 * 5;
-reloadText.y = renderer.height / 7 * 6;
+reloadText.y = renderer.height * 7 * 6;
 reloadText.visible = false;
 

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:71:22
 const reloadText = new PIXI.Text('PRESS \'R\' TO RELOAD', reloadStyle);
 reloadText.x = renderer.width / 10 * 5;
 reloadText.y = renderer.height / 7 * 6;
-reloadText.visible = false;
+reloadText.visible = true;
 
 // Add custom cursor styles

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:88:21
 // create a new Sprite using the texture
 let player = new PIXI.Sprite(playerStaleRight);
 // move the sprite to the center of the screen
-player.position.x = renderer.width / 2;
+player.position.x = renderer.width * 2;
 player.position.y = renderer.height / 2;
 player.vx = 0;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:89:21
 let player = new PIXI.Sprite(playerStaleRight);
 // move the sprite to the center of the screen
 player.position.x = renderer.width / 2;
-player.position.y = renderer.height / 2;
+player.position.y = renderer.height * 2;
 player.vx = 0;
 player.vy = 0;

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:97:19
 player.scale.y = 1.5;
 
 const gunTimeout = 10;
-player.shooting = false;
+player.shooting = true;
 player.shootingTimeout = gunTimeout;
 

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:101:26
 player.shootingTimeout = gunTimeout;
 
 stageLevel.addChild(player);
-stageLevel.interactive = true;
+stageLevel.interactive = false;
 stageLevel.on('mousedown', _ => {
   player.shooting = true;

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:102:33
 
 stageLevel.addChild(player);
 stageLevel.interactive = true;
-stageLevel.on('mousedown', _ => {
-  player.shooting = true;
-});
+stageLevel.on('mousedown', _ => {});
 stageLevel.on('mouseup', _ => {
   player.shooting = false;

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:103:21
 stageLevel.addChild(player);
 stageLevel.interactive = true;
 stageLevel.on('mousedown', _ => {
-  player.shooting = true;
+  player.shooting = false;
 });
 stageLevel.on('mouseup', _ => {

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:105:31
 stageLevel.on('mousedown', _ => {
   player.shooting = true;
 });
-stageLevel.on('mouseup', _ => {
-  player.shooting = false;
-  player.shootingTimeout = gunTimeout;
-});
+stageLevel.on('mouseup', _ => {});
 // yet to make it modular
 class BulletPool {

[Survived] StringLiteral
Rage-Party/src/scripts/game.js:105:15
 stageLevel.on('mousedown', _ => {
   player.shooting = true;
 });
-stageLevel.on('mouseup', _ => {
+stageLevel.on("", _ => {
   player.shooting = false;
   player.shootingTimeout = gunTimeout;

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:106:21
   player.shooting = true;
 });
 stageLevel.on('mouseup', _ => {
-  player.shooting = false;
+  player.shooting = true;
   player.shootingTimeout = gunTimeout;
 });

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:115:19
     this.texture = texture;
     this.bulletPool = [];
 
-    this.active = false;
+    this.active = true;
     this.amount = bulletAmount;
     this.bulletsLeft = bulletAmount;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:120:25
     this.bulletsLeft = bulletAmount;
     this.speed = bulletSpeed;
 
-    ammoLeftText.text = this.bulletsLeft + ' / ' + this.amount;
+    ammoLeftText.text = this.bulletsLeft + ' / ' - this.amount;
 
     this.reloadSpeed = reloadSpeed;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:120:25
     this.bulletsLeft = bulletAmount;
     this.speed = bulletSpeed;
 
-    ammoLeftText.text = this.bulletsLeft + ' / ' + this.amount;
+    ammoLeftText.text = this.bulletsLeft - ' / ' + this.amount;
 
     this.reloadSpeed = reloadSpeed;

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:123:24
     ammoLeftText.text = this.bulletsLeft + ' / ' + this.amount;
 
     this.reloadSpeed = reloadSpeed;
-    this.isReloading = false;
+    this.isReloading = true;
     this.reloadCooldown = reloadSpeed;
 

[Survived] EqualityOperator
Rage-Party/src/scripts/game.js:126:21
     this.isReloading = false;
     this.reloadCooldown = reloadSpeed;
 
-    for (let i = 0; i < bulletAmount; i++) {
+    for (let i = 0; i >= bulletAmount; i++) {
       const bullet = new PIXI.Sprite(this.texture);
       bullet.position.x = 0;

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:126:21
     this.isReloading = false;
     this.reloadCooldown = reloadSpeed;
 
-    for (let i = 0; i < bulletAmount; i++) {
+    for (let i = 0; false; i++) {
       const bullet = new PIXI.Sprite(this.texture);
       bullet.position.x = 0;

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:130:24
       const bullet = new PIXI.Sprite(this.texture);
       bullet.position.x = 0;
       bullet.position.y = 0;
-      bullet.visible = false;
+      bullet.visible = true;
       bullet.scale.x = 1.5;
       bullet.scale.y = 1.5;

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:139:20
     }
   }
 
-  getBulletsLeft() {
-    return this.bulletsLeft;
-  }
+  getBulletsLeft() {}
 
   getBulletsAmount() {

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:143:22
     return this.bulletsLeft;
   }
 
-  getBulletsAmount() {
-    return this.amount;
-  }
+  getBulletsAmount() {}
 
   getReloadSpeed() {

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:147:20
     return this.amount;
   }
 
-  getReloadSpeed() {
-    return this.reloadSpeed;
-  }
+  getReloadSpeed() {}
 
   next() {

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:151:10
     return this.reloadSpeed;
   }
 
-  next() {
-    this.active = true;
-    const bulletNext = this.bulletPool.pop();
-    bulletNext.visible = true;
-    this.bulletPool.unshift(bulletNext);
-    return bulletNext;
-  }
+  next() {}
 
   updateBulletsSpeed() {

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:152:19
   }
 
   next() {
-    this.active = true;
+    this.active = false;
     const bulletNext = this.bulletPool.pop();
     bulletNext.visible = true;

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:154:26
   next() {
     this.active = true;
     const bulletNext = this.bulletPool.pop();
-    bulletNext.visible = true;
+    bulletNext.visible = false;
     this.bulletPool.unshift(bulletNext);
     return bulletNext;

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:160:9
   }
 
   updateBulletsSpeed() {
-    if (this.active) {
+    if (false) {
       for (let b = this.bulletPool.length - 1; b >= 0; b--) {
         if (this.bulletPool[b].active &&

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:160:9
   }
 
   updateBulletsSpeed() {
-    if (this.active) {
+    if (true) {
       for (let b = this.bulletPool.length - 1; b >= 0; b--) {
         if (this.bulletPool[b].active &&

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:161:48
 
   updateBulletsSpeed() {
     if (this.active) {
-      for (let b = this.bulletPool.length - 1; b >= 0; b--) {
+      for (let b = this.bulletPool.length - 1; false; b--) {
         if (this.bulletPool[b].active &&
           (contain(this.bulletPool[b], dungeon).x !== collisionType.no ||

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:161:20
 
   updateBulletsSpeed() {
     if (this.active) {
-      for (let b = this.bulletPool.length - 1; b >= 0; b--) {
+      for (let b = this.bulletPool.length + 1; b >= 0; b--) {
         if (this.bulletPool[b].active &&
           (contain(this.bulletPool[b], dungeon).x !== collisionType.no ||

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:162:13
   updateBulletsSpeed() {
     if (this.active) {
       for (let b = this.bulletPool.length - 1; b >= 0; b--) {
-        if (this.bulletPool[b].active &&
-          (contain(this.bulletPool[b], dungeon).x !== collisionType.no ||
-            contain(this.bulletPool[b], dungeon).y !== collisionType.no)) {
+        if (false) {
           this.bulletPool[b].visible = false;
 

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:162:13
   updateBulletsSpeed() {
     if (this.active) {
       for (let b = this.bulletPool.length - 1; b >= 0; b--) {
-        if (this.bulletPool[b].active &&
-          (contain(this.bulletPool[b], dungeon).x !== collisionType.no ||
-            contain(this.bulletPool[b], dungeon).y !== collisionType.no)) {
+        if (true) {
           this.bulletPool[b].visible = false;
 

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:163:12
     if (this.active) {
       for (let b = this.bulletPool.length - 1; b >= 0; b--) {
         if (this.bulletPool[b].active &&
-          (contain(this.bulletPool[b], dungeon).x !== collisionType.no ||
-            contain(this.bulletPool[b], dungeon).y !== collisionType.no)) {
+          (false)) {
           this.bulletPool[b].visible = false;
 

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:163:12
     if (this.active) {
       for (let b = this.bulletPool.length - 1; b >= 0; b--) {
         if (this.bulletPool[b].active &&
-          (contain(this.bulletPool[b], dungeon).x !== collisionType.no ||
+          (false ||
             contain(this.bulletPool[b], dungeon).y !== collisionType.no)) {
           this.bulletPool[b].visible = false;

[Survived] EqualityOperator
Rage-Party/src/scripts/game.js:164:13
       for (let b = this.bulletPool.length - 1; b >= 0; b--) {
         if (this.bulletPool[b].active &&
           (contain(this.bulletPool[b], dungeon).x !== collisionType.no ||
-            contain(this.bulletPool[b], dungeon).y !== collisionType.no)) {
+            contain(this.bulletPool[b], dungeon).y === collisionType.no)) {
           this.bulletPool[b].visible = false;
 

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:164:13
       for (let b = this.bulletPool.length - 1; b >= 0; b--) {
         if (this.bulletPool[b].active &&
           (contain(this.bulletPool[b], dungeon).x !== collisionType.no ||
-            contain(this.bulletPool[b], dungeon).y !== collisionType.no)) {
+            true)) {
           this.bulletPool[b].visible = false;
 

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:165:40
         if (this.bulletPool[b].active &&
           (contain(this.bulletPool[b], dungeon).x !== collisionType.no ||
             contain(this.bulletPool[b], dungeon).y !== collisionType.no)) {
-          this.bulletPool[b].visible = false;
+          this.bulletPool[b].visible = true;
 
           const explosion = new PIXI.extras.AnimatedSprite(explosionTextures);

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:172:32
           explosion.x = this.bulletPool[b].x;
           explosion.y = this.bulletPool[b].y;
           explosion.anchor.set(0.5);
-          explosion.rotation = Math.random() * Math.PI;
+          explosion.rotation = Math.random() / Math.PI;
           explosion.scale.set(0.2 + Math.random() * 0.2);
           explosion.loop = false;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:173:37
           explosion.y = this.bulletPool[b].y;
           explosion.anchor.set(0.5);
           explosion.rotation = Math.random() * Math.PI;
-          explosion.scale.set(0.2 + Math.random() * 0.2);
+          explosion.scale.set(0.2 + Math.random() / 0.2);
           explosion.loop = false;
           explosion.animationSpeed = 0.5;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:173:31
           explosion.y = this.bulletPool[b].y;
           explosion.anchor.set(0.5);
           explosion.rotation = Math.random() * Math.PI;
-          explosion.scale.set(0.2 + Math.random() * 0.2);
+          explosion.scale.set(0.2 - Math.random() * 0.2);
           explosion.loop = false;
           explosion.animationSpeed = 0.5;

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:174:28
           explosion.anchor.set(0.5);
           explosion.rotation = Math.random() * Math.PI;
           explosion.scale.set(0.2 + Math.random() * 0.2);
-          explosion.loop = false;
+          explosion.loop = true;
           explosion.animationSpeed = 0.5;
           explosion.play();

[Survived] ArrowFunction
Rage-Party/src/scripts/game.js:177:34
           explosion.loop = false;
           explosion.animationSpeed = 0.5;
           explosion.play();
-          explosion.onComplete = () => stageLevel.removeChild(explosion);
+          explosion.onComplete = () => undefined;
           stageLevel.addChild(explosion);
 

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:180:39
           explosion.onComplete = () => stageLevel.removeChild(explosion);
           stageLevel.addChild(explosion);
 
-          this.bulletPool[b].active = false;
+          this.bulletPool[b].active = true;
         }
         if (this.bulletPool[b].active) {

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:182:13
 
           this.bulletPool[b].active = false;
         }
-        if (this.bulletPool[b].active) {
+        if (false) {
           this.bulletPool[b].x +=
             this.bulletPool[b].direction.x * this.speed;

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:182:40
 
           this.bulletPool[b].active = false;
         }
-        if (this.bulletPool[b].active) {
-          this.bulletPool[b].x +=
-            this.bulletPool[b].direction.x * this.speed;
-          this.bulletPool[b].y +=
-            this.bulletPool[b].direction.y * this.speed;
-        }
+        if (this.bulletPool[b].active) {}
       }
     }

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:184:13
         }
         if (this.bulletPool[b].active) {
           this.bulletPool[b].x +=
-            this.bulletPool[b].direction.x * this.speed;
+            this.bulletPool[b].direction.x / this.speed;
           this.bulletPool[b].y +=
             this.bulletPool[b].direction.y * this.speed;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:186:13
           this.bulletPool[b].x +=
             this.bulletPool[b].direction.x * this.speed;
           this.bulletPool[b].y +=
-            this.bulletPool[b].direction.y * this.speed;
+            this.bulletPool[b].direction.y / this.speed;
         }
       }

[Survived] EqualityOperator
Rage-Party/src/scripts/game.js:190:29
         }
       }
     }
-    if (this.isReloading && this.reloadCooldown > 0) {
+    if (this.isReloading && this.reloadCooldown <= 0) {
       reloadText.text = 'WAIT';
       --this.reloadCooldown;

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:190:54
         }
       }
     }
-    if (this.isReloading && this.reloadCooldown > 0) {
-      reloadText.text = 'WAIT';
-      --this.reloadCooldown;
-    } else if (this.isReloading && this.reloadCooldown === 0) {
+    if (this.isReloading && this.reloadCooldown > 0) {} else if (this.isReloading && this.reloadCooldown === 0) {
       this.isReloading = false;
       this.bulletsLeft = this.amount;

[Survived] UpdateOperator
Rage-Party/src/scripts/game.js:192:7
     }
     if (this.isReloading && this.reloadCooldown > 0) {
       reloadText.text = 'WAIT';
-      --this.reloadCooldown;
+      ++this.reloadCooldown;
     } else if (this.isReloading && this.reloadCooldown === 0) {
       this.isReloading = false;

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:193:36
     if (this.isReloading && this.reloadCooldown > 0) {
       reloadText.text = 'WAIT';
       --this.reloadCooldown;
-    } else if (this.isReloading && this.reloadCooldown === 0) {
+    } else if (this.isReloading && true) {
       this.isReloading = false;
       this.bulletsLeft = this.amount;

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:193:16
     if (this.isReloading && this.reloadCooldown > 0) {
       reloadText.text = 'WAIT';
       --this.reloadCooldown;
-    } else if (this.isReloading && this.reloadCooldown === 0) {
+    } else if (true) {
       this.isReloading = false;
       this.bulletsLeft = this.amount;

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:194:26
       reloadText.text = 'WAIT';
       --this.reloadCooldown;
     } else if (this.isReloading && this.reloadCooldown === 0) {
-      this.isReloading = false;
+      this.isReloading = true;
       this.bulletsLeft = this.amount;
       ammoLeftText.text = this.bulletsLeft + ' / ' + this.amount;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:196:27
     } else if (this.isReloading && this.reloadCooldown === 0) {
       this.isReloading = false;
       this.bulletsLeft = this.amount;
-      ammoLeftText.text = this.bulletsLeft + ' / ' + this.amount;
+      ammoLeftText.text = this.bulletsLeft - ' / ' + this.amount;
       reloadText.visible = false;
     }

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:196:27
     } else if (this.isReloading && this.reloadCooldown === 0) {
       this.isReloading = false;
       this.bulletsLeft = this.amount;
-      ammoLeftText.text = this.bulletsLeft + ' / ' + this.amount;
+      ammoLeftText.text = this.bulletsLeft + ' / ' - this.amount;
       reloadText.visible = false;
     }

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:197:28
       this.isReloading = false;
       this.bulletsLeft = this.amount;
       ammoLeftText.text = this.bulletsLeft + ' / ' + this.amount;
-      reloadText.visible = false;
+      reloadText.visible = true;
     }
   }

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:201:17
     }
   }
 
-  shoot(mX, mY) {
-    if (!this.isReloading && this.bulletsLeft > 0) {
-      const bullet = this.next();
-      --this.bulletsLeft;
-
-      ammoLeftText.text = this.bulletsLeft + ' / ' + this.amount;
-
-      bullet.direction.x = mX - player.x;
-      bullet.direction.y = mY - player.y;
-
-      const length = Math.sqrt(
-        bullet.direction.x * bullet.direction.x +
-        bullet.direction.y * bullet.direction.y);
-      bullet.direction.x /= length;
-      bullet.direction.y /= length;
-
-      bullet.position.x = player.x + player.width / 5;
-      bullet.position.y = player.y + player.height / 3;
-
-      bullet.active = true;
-    } else if (!this.isReloading && this.bulletsLeft === 0) {
-      reloadText.text = 'PRESS \'R\' TO RELOAD';
-      reloadText.visible = true;
-    }
-  }
+  shoot(mX, mY) {}
 
   reload() {

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:202:9
   }
 
   shoot(mX, mY) {
-    if (!this.isReloading && this.bulletsLeft > 0) {
+    if (this.isReloading && this.bulletsLeft > 0) {
       const bullet = this.next();
       --this.bulletsLeft;

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:202:9
   }
 
   shoot(mX, mY) {
-    if (!this.isReloading && this.bulletsLeft > 0) {
+    if (false) {
       const bullet = this.next();
       --this.bulletsLeft;

[Survived] UpdateOperator
Rage-Party/src/scripts/game.js:204:7
   shoot(mX, mY) {
     if (!this.isReloading && this.bulletsLeft > 0) {
       const bullet = this.next();
-      --this.bulletsLeft;
+      ++this.bulletsLeft;
 
       ammoLeftText.text = this.bulletsLeft + ' / ' + this.amount;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:208:28
 
       ammoLeftText.text = this.bulletsLeft + ' / ' + this.amount;
 
-      bullet.direction.x = mX - player.x;
+      bullet.direction.x = mX + player.x;
       bullet.direction.y = mY - player.y;
 

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:209:28
       ammoLeftText.text = this.bulletsLeft + ' / ' + this.amount;
 
       bullet.direction.x = mX - player.x;
-      bullet.direction.y = mY - player.y;
+      bullet.direction.y = mY + player.y;
 
       const length = Math.sqrt(
