[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:212:9
       bullet.direction.y = mY - player.y;
 
       const length = Math.sqrt(
-        bullet.direction.x * bullet.direction.x +
-        bullet.direction.y * bullet.direction.y);
+        bullet.direction.x * bullet.direction.x - bullet.direction.y * bullet.direction.y);
       bullet.direction.x /= length;
       bullet.direction.y /= length;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:212:9
       bullet.direction.y = mY - player.y;
 
       const length = Math.sqrt(
-        bullet.direction.x * bullet.direction.x +
+        bullet.direction.x / bullet.direction.x +
         bullet.direction.y * bullet.direction.y);
       bullet.direction.x /= length;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:213:9
 
       const length = Math.sqrt(
         bullet.direction.x * bullet.direction.x +
-        bullet.direction.y * bullet.direction.y);
+        bullet.direction.y / bullet.direction.y);
       bullet.direction.x /= length;
       bullet.direction.y /= length;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:217:27
       bullet.direction.x /= length;
       bullet.direction.y /= length;
 
-      bullet.position.x = player.x + player.width / 5;
+      bullet.position.x = player.x - player.width / 5;
       bullet.position.y = player.y + player.height / 3;
 

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:217:38
       bullet.direction.x /= length;
       bullet.direction.y /= length;
 
-      bullet.position.x = player.x + player.width / 5;
+      bullet.position.x = player.x + player.width * 5;
       bullet.position.y = player.y + player.height / 3;
 

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:218:27
       bullet.direction.y /= length;
 
       bullet.position.x = player.x + player.width / 5;
-      bullet.position.y = player.y + player.height / 3;
+      bullet.position.y = player.y - player.height / 3;
 
       bullet.active = true;

[Survived] ArithmeticOperator
Rage-Party/src/scripts/game.js:218:38
       bullet.direction.y /= length;
 
       bullet.position.x = player.x + player.width / 5;
-      bullet.position.y = player.y + player.height / 3;
+      bullet.position.y = player.y + player.height * 3;
 
       bullet.active = true;

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:220:23
       bullet.position.x = player.x + player.width / 5;
       bullet.position.y = player.y + player.height / 3;
 
-      bullet.active = true;
+      bullet.active = false;
     } else if (!this.isReloading && this.bulletsLeft === 0) {
       reloadText.text = 'PRESS \'R\' TO RELOAD';

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:221:16
       bullet.position.y = player.y + player.height / 3;
 
       bullet.active = true;
-    } else if (!this.isReloading && this.bulletsLeft === 0) {
+    } else if (true) {
       reloadText.text = 'PRESS \'R\' TO RELOAD';
       reloadText.visible = true;

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:221:16
       bullet.position.y = player.y + player.height / 3;
 
       bullet.active = true;
-    } else if (!this.isReloading && this.bulletsLeft === 0) {
+    } else if (this.isReloading && this.bulletsLeft === 0) {
       reloadText.text = 'PRESS \'R\' TO RELOAD';
       reloadText.visible = true;

[Survived] StringLiteral
Rage-Party/src/scripts/game.js:222:25
 
       bullet.active = true;
     } else if (!this.isReloading && this.bulletsLeft === 0) {
-      reloadText.text = 'PRESS \'R\' TO RELOAD';
+      reloadText.text = "";
       reloadText.visible = true;
     }

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:223:28
       bullet.active = true;
     } else if (!this.isReloading && this.bulletsLeft === 0) {
       reloadText.text = 'PRESS \'R\' TO RELOAD';
-      reloadText.visible = true;
+      reloadText.visible = false;
     }
   }

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:227:12
     }
   }
 
-  reload() {
-    this.isReloading = true;
-    this.reloadCooldown = this.reloadSpeed;
-  }
+  reload() {}
 
 }

[Survived] BooleanLiteral
Rage-Party/src/scripts/game.js:228:24
   }
 
   reload() {
-    this.isReloading = true;
+    this.isReloading = false;
     this.reloadCooldown = this.reloadSpeed;
   }

[Survived] ArrowFunction
Rage-Party/src/scripts/game.js:243:14
 // character control
 const linearSpeed = 7;
 
-left.press = () => player.vx -= linearSpeed;
+left.press = () => undefined;
 left.release = () => player.vx += linearSpeed;
 

[Survived] ArrowFunction
Rage-Party/src/scripts/game.js:244:16
 const linearSpeed = 7;
 
 left.press = () => player.vx -= linearSpeed;
-left.release = () => player.vx += linearSpeed;
+left.release = () => undefined;
 
 up.press = () => player.vy += linearSpeed;

[Survived] ArrowFunction
Rage-Party/src/scripts/game.js:246:12
 left.press = () => player.vx -= linearSpeed;
 left.release = () => player.vx += linearSpeed;
 
-up.press = () => player.vy += linearSpeed;
+up.press = () => undefined;
 up.release = () => player.vy -= linearSpeed;
 

[Survived] ArrowFunction
Rage-Party/src/scripts/game.js:247:14
 left.release = () => player.vx += linearSpeed;
 
 up.press = () => player.vy += linearSpeed;
-up.release = () => player.vy -= linearSpeed;
+up.release = () => undefined;
 
 right.press = () => player.vx += linearSpeed;

[Survived] ArrowFunction
Rage-Party/src/scripts/game.js:249:15
 up.press = () => player.vy += linearSpeed;
 up.release = () => player.vy -= linearSpeed;
 
-right.press = () => player.vx += linearSpeed;
+right.press = () => undefined;
 right.release = () => player.vx -= linearSpeed;
 

[Survived] ArrowFunction
Rage-Party/src/scripts/game.js:250:17
 up.release = () => player.vy -= linearSpeed;
 
 right.press = () => player.vx += linearSpeed;
-right.release = () => player.vx -= linearSpeed;
+right.release = () => undefined;
 
 down.press = () => player.vy -= linearSpeed;

[Survived] ArrowFunction
Rage-Party/src/scripts/game.js:252:14
 right.press = () => player.vx += linearSpeed;
 right.release = () => player.vx -= linearSpeed;
 
-down.press = () => player.vy -= linearSpeed;
+down.press = () => undefined;
 down.release = () => player.vy += linearSpeed;
 

[Survived] ArrowFunction
Rage-Party/src/scripts/game.js:253:16
 right.release = () => player.vx -= linearSpeed;
 
 down.press = () => player.vy -= linearSpeed;
-down.release = () => player.vy += linearSpeed;
+down.release = () => undefined;
 
 reloadButton.press = () => playerBulletPool.reload();

[Survived] ArrowFunction
Rage-Party/src/scripts/game.js:255:22
 down.press = () => player.vy -= linearSpeed;
 down.release = () => player.vy += linearSpeed;
 
-reloadButton.press = () => playerBulletPool.reload();
+reloadButton.press = () => undefined;
 
 function MoveCreature(creature) {

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:257:33
 
 reloadButton.press = () => playerBulletPool.reload();
 
-function MoveCreature(creature) {
-  const playerCollisions = contain(creature, dungeon);
-
-  if (playerCollisions.x === collisionType.no ||
-    ((playerCollisions.x === collisionType.left) && (player.vx >= 0)) ||
-    ((playerCollisions.x === collisionType.right) && (player.vx <= 0))
-  ) {
-    creature.x += creature.vx;
-  }
-  if (playerCollisions.y === collisionType.no ||
-    ((playerCollisions.y === collisionType.top) && (player.vy <= 0)) ||
-    ((playerCollisions.y === collisionType.down) && (player.vy >= 0))
-  ) {
-    creature.y -= creature.vy;
-  }
-}
+function MoveCreature(creature) {}
 
 function AnimatePlayer(mouseX) {

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:260:7
 function MoveCreature(creature) {
   const playerCollisions = contain(creature, dungeon);
 
-  if (playerCollisions.x === collisionType.no ||
-    ((playerCollisions.x === collisionType.left) && (player.vx >= 0)) ||
-    ((playerCollisions.x === collisionType.right) && (player.vx <= 0))
+  if (false
   ) {
     creature.x += creature.vx;

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:260:7
 function MoveCreature(creature) {
   const playerCollisions = contain(creature, dungeon);
 
-  if (playerCollisions.x === collisionType.no ||
-    ((playerCollisions.x === collisionType.left) && (player.vx >= 0)) ||
+  if (false ||
     ((playerCollisions.x === collisionType.right) && (player.vx <= 0))
   ) {

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:261:7
   const playerCollisions = contain(creature, dungeon);
 
   if (playerCollisions.x === collisionType.no ||
-    ((playerCollisions.x === collisionType.left) && (player.vx >= 0)) ||
+    ((false) && (player.vx >= 0)) ||
     ((playerCollisions.x === collisionType.right) && (player.vx <= 0))
   ) {

[Survived] EqualityOperator
Rage-Party/src/scripts/game.js:261:54
   const playerCollisions = contain(creature, dungeon);
 
   if (playerCollisions.x === collisionType.no ||
-    ((playerCollisions.x === collisionType.left) && (player.vx >= 0)) ||
+    ((playerCollisions.x === collisionType.left) && (player.vx < 0)) ||
     ((playerCollisions.x === collisionType.right) && (player.vx <= 0))
   ) {

[Survived] EqualityOperator
Rage-Party/src/scripts/game.js:262:7
 
   if (playerCollisions.x === collisionType.no ||
     ((playerCollisions.x === collisionType.left) && (player.vx >= 0)) ||
-    ((playerCollisions.x === collisionType.right) && (player.vx <= 0))
+    ((playerCollisions.x !== collisionType.right) && (player.vx <= 0))
   ) {
     creature.x += creature.vx;

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:262:6
 
   if (playerCollisions.x === collisionType.no ||
     ((playerCollisions.x === collisionType.left) && (player.vx >= 0)) ||
-    ((playerCollisions.x === collisionType.right) && (player.vx <= 0))
+    (false)
   ) {
     creature.x += creature.vx;

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:263:5
   if (playerCollisions.x === collisionType.no ||
     ((playerCollisions.x === collisionType.left) && (player.vx >= 0)) ||
     ((playerCollisions.x === collisionType.right) && (player.vx <= 0))
-  ) {
-    creature.x += creature.vx;
-  }
+  ) {}
   if (playerCollisions.y === collisionType.no ||
     ((playerCollisions.y === collisionType.top) && (player.vy <= 0)) ||

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:266:7
   ) {
     creature.x += creature.vx;
   }
-  if (playerCollisions.y === collisionType.no ||
-    ((playerCollisions.y === collisionType.top) && (player.vy <= 0)) ||
-    ((playerCollisions.y === collisionType.down) && (player.vy >= 0))
+  if (false
   ) {
     creature.y -= creature.vy;

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:266:7
   ) {
     creature.x += creature.vx;
   }
-  if (playerCollisions.y === collisionType.no ||
-    ((playerCollisions.y === collisionType.top) && (player.vy <= 0)) ||
+  if (false ||
     ((playerCollisions.y === collisionType.down) && (player.vy >= 0))
   ) {

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:267:7
     creature.x += creature.vx;
   }
   if (playerCollisions.y === collisionType.no ||
-    ((playerCollisions.y === collisionType.top) && (player.vy <= 0)) ||
+    ((true) && (player.vy <= 0)) ||
     ((playerCollisions.y === collisionType.down) && (player.vy >= 0))
   ) {

[Survived] LogicalOperator
Rage-Party/src/scripts/game.js:267:6
     creature.x += creature.vx;
   }
   if (playerCollisions.y === collisionType.no ||
-    ((playerCollisions.y === collisionType.top) && (player.vy <= 0)) ||
+    (playerCollisions.y === collisionType.top || player.vy <= 0) ||
     ((playerCollisions.y === collisionType.down) && (player.vy >= 0))
   ) {

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:268:54
   }
   if (playerCollisions.y === collisionType.no ||
     ((playerCollisions.y === collisionType.top) && (player.vy <= 0)) ||
-    ((playerCollisions.y === collisionType.down) && (player.vy >= 0))
+    ((playerCollisions.y === collisionType.down) && (true))
   ) {
     creature.y -= creature.vy;

[Survived] EqualityOperator
Rage-Party/src/scripts/game.js:268:7
   }
   if (playerCollisions.y === collisionType.no ||
     ((playerCollisions.y === collisionType.top) && (player.vy <= 0)) ||
-    ((playerCollisions.y === collisionType.down) && (player.vy >= 0))
+    ((playerCollisions.y !== collisionType.down) && (player.vy >= 0))
   ) {
     creature.y -= creature.vy;

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:269:5
   if (playerCollisions.y === collisionType.no ||
     ((playerCollisions.y === collisionType.top) && (player.vy <= 0)) ||
     ((playerCollisions.y === collisionType.down) && (player.vy >= 0))
-  ) {
-    creature.y -= creature.vy;
-  }
+  ) {}
 }
 

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:278:13
 
   const x = player.x,
     y = player.y,
-    half = (mouseX >= renderer.width / 2 ? 2 : 1);
+    half = (false ? 2 : 1);
 
   if (player.lastMouseHalf !== half) {

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:278:13
 
   const x = player.x,
     y = player.y,
-    half = (mouseX >= renderer.width / 2 ? 2 : 1);
+    half = (true ? 2 : 1);
 
   if (player.lastMouseHalf !== half) {

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:280:38
     y = player.y,
     half = (mouseX >= renderer.width / 2 ? 2 : 1);
 
-  if (player.lastMouseHalf !== half) {
-    if (mouseX >= player.x) {
-      player = playerRunningRight;
-      player.play();
-    } else {
-      player = playerRunningLeft;
-      player.play();
-    }
-    // if (player.vx === 0 && player.vy === 0) {
-    //   player = new PIXI.Sprite((mouseX >= player.x ?
-    //     playerStaleRight : playerStaleLeft));
-    //   console.log('stale: vx = ' + player.vx + '; vy = ' + player.vy);
-    // }
-  }
+  if (player.lastMouseHalf !== half) {}
   player.x = x;
   player.y = y;

[Survived] EqualityOperator
Rage-Party/src/scripts/game.js:280:7
     y = player.y,
     half = (mouseX >= renderer.width / 2 ? 2 : 1);
 
-  if (player.lastMouseHalf !== half) {
+  if (player.lastMouseHalf === half) {
     if (mouseX >= player.x) {
       player = playerRunningRight;

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:281:29
     half = (mouseX >= renderer.width / 2 ? 2 : 1);
 
   if (player.lastMouseHalf !== half) {
-    if (mouseX >= player.x) {
-      player = playerRunningRight;
-      player.play();
-    } else {
+    if (mouseX >= player.x) {} else {
       player = playerRunningLeft;
       player.play();

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:281:9
     half = (mouseX >= renderer.width / 2 ? 2 : 1);
 
   if (player.lastMouseHalf !== half) {
-    if (mouseX >= player.x) {
+    if (true) {
       player = playerRunningRight;
       player.play();

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:284:12
     if (mouseX >= player.x) {
       player = playerRunningRight;
       player.play();
-    } else {
-      player = playerRunningLeft;
-      player.play();
-    }
+    } else {}
     // if (player.vx === 0 && player.vy === 0) {
     //   player = new PIXI.Sprite((mouseX >= player.x ?

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:307:20
 // start animating
 ScaleToWindow(renderer.view);
 animate();
-function animate() {
-  MoveCreature(player);
-  playerBulletPool.updateBulletsSpeed();
-  if (player.shooting) {
-
-    if (player.shootingTimeout === gunTimeout) {
-      player.shootingTimeout = 0;
-      playerBulletPool.shoot(
-        renderer.plugins.interaction.mouse.global.x,
-        renderer.plugins.interaction.mouse.global.y
-      );
-    }
-    ++player.shootingTimeout;
-  }
-  AnimatePlayer(renderer.plugins.interaction.mouse.global.x);
-
-  // render the container
-  renderer.render(stageLevel);
-  requestAnimationFrame(animate);
-}
+function animate() {}
 
 module.exports = {

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:310:7
 function animate() {
   MoveCreature(player);
   playerBulletPool.updateBulletsSpeed();
-  if (player.shooting) {
+  if (true) {
 
     if (player.shootingTimeout === gunTimeout) {

[Survived] BlockStatement
Rage-Party/src/scripts/game.js:310:24
 function animate() {
   MoveCreature(player);
   playerBulletPool.updateBulletsSpeed();
-  if (player.shooting) {
-
-    if (player.shootingTimeout === gunTimeout) {
-      player.shootingTimeout = 0;
-      playerBulletPool.shoot(
-        renderer.plugins.interaction.mouse.global.x,
-        renderer.plugins.interaction.mouse.global.y
-      );
-    }
-    ++player.shootingTimeout;
-  }
+  if (player.shooting) {}
   AnimatePlayer(renderer.plugins.interaction.mouse.global.x);
 

[Survived] EqualityOperator
Rage-Party/src/scripts/game.js:312:9
   playerBulletPool.updateBulletsSpeed();
   if (player.shooting) {
 
-    if (player.shootingTimeout === gunTimeout) {
+    if (player.shootingTimeout !== gunTimeout) {
       player.shootingTimeout = 0;
       playerBulletPool.shoot(

[Survived] ConditionalExpression
Rage-Party/src/scripts/game.js:312:9
   playerBulletPool.updateBulletsSpeed();
   if (player.shooting) {
 
-    if (player.shootingTimeout === gunTimeout) {
+    if (true) {
       player.shootingTimeout = 0;
       playerBulletPool.shoot(

[Survived] UpdateOperator
Rage-Party/src/scripts/game.js:319:5
         renderer.plugins.interaction.mouse.global.y
       );
     }
-    ++player.shootingTimeout;
+    --player.shootingTimeout;
   }
   AnimatePlayer(renderer.plugins.interaction.mouse.global.x);
