[Survived] BooleanLiteral
Rage-Party/src/scripts/keyboard.js:4:16
 export function keyboard(value) {
   const key = {};
   key.value = value;
-  key.isDown = false;
+  key.isDown = true;
   key.isUp = true;
   key.press = undefined;

[Survived] BooleanLiteral
Rage-Party/src/scripts/keyboard.js:5:14
   const key = {};
   key.value = value;
   key.isDown = false;
-  key.isUp = true;
+  key.isUp = false;
   key.press = undefined;
   key.release = undefined;

[Survived] BlockStatement
Rage-Party/src/scripts/keyboard.js:9:30
   key.press = undefined;
   key.release = undefined;
   //The `downHandler`
-  key.downHandler = event => {
-    if (event.code === key.value) {
-      if (key.isUp && key.press) key.press();
-      key.isDown = true;
-      key.isUp = false;
-      event.preventDefault();
-    }
-  };
+  key.downHandler = event => {};
 
   //The `upHandler`

[Survived] ConditionalExpression
Rage-Party/src/scripts/keyboard.js:10:9
   key.release = undefined;
   //The `downHandler`
   key.downHandler = event => {
-    if (event.code === key.value) {
+    if (true) {
       if (key.isUp && key.press) key.press();
       key.isDown = true;

[Survived] BlockStatement
Rage-Party/src/scripts/keyboard.js:10:35
   key.release = undefined;
   //The `downHandler`
   key.downHandler = event => {
-    if (event.code === key.value) {
-      if (key.isUp && key.press) key.press();
-      key.isDown = true;
-      key.isUp = false;
-      event.preventDefault();
-    }
+    if (event.code === key.value) {}
   };
 

[Survived] ConditionalExpression
Rage-Party/src/scripts/keyboard.js:11:11
   //The `downHandler`
   key.downHandler = event => {
     if (event.code === key.value) {
-      if (key.isUp && key.press) key.press();
+      if (true) key.press();
       key.isDown = true;
       key.isUp = false;

[Survived] ConditionalExpression
Rage-Party/src/scripts/keyboard.js:11:11
   //The `downHandler`
   key.downHandler = event => {
     if (event.code === key.value) {
-      if (key.isUp && key.press) key.press();
+      if (false) key.press();
       key.isDown = true;
       key.isUp = false;

[Survived] BooleanLiteral
Rage-Party/src/scripts/keyboard.js:12:20
   key.downHandler = event => {
     if (event.code === key.value) {
       if (key.isUp && key.press) key.press();
-      key.isDown = true;
+      key.isDown = false;
       key.isUp = false;
       event.preventDefault();

[Survived] BooleanLiteral
Rage-Party/src/scripts/keyboard.js:13:18
     if (event.code === key.value) {
       if (key.isUp && key.press) key.press();
       key.isDown = true;
-      key.isUp = false;
+      key.isUp = true;
       event.preventDefault();
     }

[Survived] BlockStatement
Rage-Party/src/scripts/keyboard.js:19:28
   };
 
   //The `upHandler`
-  key.upHandler = event => {
-    if (event.code === key.value) {
-      if (key.isDown && key.release) key.release();
-      key.isDown = false;
-      key.isUp = true;
-      event.preventDefault();
-    }
-  };
+  key.upHandler = event => {};
 
   //Attach event listeners

[Survived] BlockStatement
Rage-Party/src/scripts/keyboard.js:20:35
 
   //The `upHandler`
   key.upHandler = event => {
-    if (event.code === key.value) {
-      if (key.isDown && key.release) key.release();
-      key.isDown = false;
-      key.isUp = true;
-      event.preventDefault();
-    }
+    if (event.code === key.value) {}
   };
 

[Survived] EqualityOperator
Rage-Party/src/scripts/keyboard.js:20:9
 
   //The `upHandler`
   key.upHandler = event => {
-    if (event.code === key.value) {
+    if (event.code !== key.value) {
       if (key.isDown && key.release) key.release();
       key.isDown = false;

[Survived] ConditionalExpression
Rage-Party/src/scripts/keyboard.js:21:11
   //The `upHandler`
   key.upHandler = event => {
     if (event.code === key.value) {
-      if (key.isDown && key.release) key.release();
+      if (true) key.release();
       key.isDown = false;
       key.isUp = true;

[Survived] ConditionalExpression
Rage-Party/src/scripts/keyboard.js:21:11
   //The `upHandler`
   key.upHandler = event => {
     if (event.code === key.value) {
-      if (key.isDown && key.release) key.release();
+      if (false) key.release();
       key.isDown = false;
       key.isUp = true;

[Survived] BooleanLiteral
Rage-Party/src/scripts/keyboard.js:22:20
   key.upHandler = event => {
     if (event.code === key.value) {
       if (key.isDown && key.release) key.release();
-      key.isDown = false;
+      key.isDown = true;
       key.isUp = true;
       event.preventDefault();

[Survived] BooleanLiteral
Rage-Party/src/scripts/keyboard.js:33:30
   const upListener = key.upHandler.bind(key);
 
   window.addEventListener(
-    'keydown', downListener, false
+    'keydown', downListener, true
   );
   window.addEventListener(

[Survived] StringLiteral
Rage-Party/src/scripts/keyboard.js:33:5
   const upListener = key.upHandler.bind(key);
 
   window.addEventListener(
-    'keydown', downListener, false
+    "", downListener, false
   );
   window.addEventListener(

[Survived] BooleanLiteral
Rage-Party/src/scripts/keyboard.js:36:26
     'keydown', downListener, false
   );
   window.addEventListener(
-    'keyup', upListener, false
+    'keyup', upListener, true
   );
 

[Survived] StringLiteral
Rage-Party/src/scripts/keyboard.js:42:30
   return key;
 }
 
-export const left = keyboard('KeyA'),
+export const left = keyboard(""),
   up = keyboard('KeyW'),
   right = keyboard('KeyD'),

[Survived] StringLiteral
Rage-Party/src/scripts/keyboard.js:43:17
 }
 
 export const left = keyboard('KeyA'),
-  up = keyboard('KeyW'),
+  up = keyboard(""),
   right = keyboard('KeyD'),
   down = keyboard('KeyS'),
