[Killed] ArithmeticOperator
Rage-Party/src/scripts/contain.js:22:7
   }
 
   // Right
-  if (sprite.position.x + sprite.width + 95 >=
+  if (sprite.position.x + sprite.width - 95 >=
     container.position.x + container.width) {
     collision.x = collisionType.right;

[Killed] ArithmeticOperator
Rage-Party/src/scripts/contain.js:28:7
   }
 
   //Top
-  if (sprite.position.y - 90 + (sprite.height * 0.5) <= container.position.y) {
+  if (sprite.position.y + 90 + (sprite.height * 0.5) <= container.position.y) {
     collision.y = collisionType.top;
   }

[Killed] ConditionalExpression
Rage-Party/src/scripts/contain.js:33:7
   }
 
   // Down
-  if (sprite.position.y + sprite.height + 90 >=
-    container.position.y + container.height) {
+  if (false) {
     collision.y = collisionType.down;
   }
